src/test/resources/mock-responses/test2/different-response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header />
	<soapenv:Body>
		<test2 xmlns="http://www.example.org/schema">
			<number>2</number>
			<text>different response</text>
		</test2>
	</soapenv:Body>
</soapenv:Envelope>
